import pandas
from time import  localtime, strftime

data = {
    "1": ["63301050001","นายกณวรรธน์ ปรึกษา","-"],
    "2": ["63301050002","นายกุลพิธาน์ ปลื้มน้อย","-"],
    "3": ["63301050003","นางสาวณัฐนันท์ พ่วงสกุล","-"],
    "4": ["63301050004","นายณัฐวุฒิ อ่อนประเสริฐ","-"],
    "5": ["63301050005","นายทินภัทร คล้ายเหล็ง","-"],
    "6": ["63301050007","นายธนลักษณ์ ทิมหลำ","-"],
    "7": ["63301050008","นายธนะดล คนเที่ยง","-"],
    "8": ["63301050009","นางสาวนพนันท์ พูลทรัพย์","-"],
    "9": ["63301050010","นางสาวนฤมล โพธิ์รี","-"],
    "10": ["63301050011","นางสาวปนัดดา อุตคุต","-"],
    "11": ["63301050012","นายพรพิพัฒน์ นุชภักดี","-"],
    "12": ["63301050013","นางสาวพาฝัน ทองสุพรรณ์","-"],
    "13": ["63301050014","นายภูมิสรัณ สุกแก้ว","-"],
    "14": ["63301050015","นายศุภวิชย์ สุขสโมสร","-"],
    "15": ["63301050016","นายสวิตต์ นุ่มทอง","-"],
    "16": ["63301050017","นายสิริชัย บุญรอด","-"],
    "17": ["63301050018","นางสาวสุกัลญา อู่ผลเจริญ","-"],
    "18": ["63301050019","นางสาวใหมทอง พูลเสริม","-"],
    "19": ["63301050020","นายอัษฎา คล้อยปาน","-"],
    "20": ["63301050021","นางสาวอารีย์รัตน์ เกิดเจริญ","-"]
}

checked = []

def check_user(check):
    if check not in checked:
        data[str(check)].pop()
        data[str(check)].append(strftime("%H:%M:%S", localtime()))
        goto_csv()
        checked.append(check)

def goto_csv():
    data_frame = pandas.DataFrame(data,index=['Student.No', 'Name Lastname', 'Check'])
    name_file = strftime("%a %d %b %Y", localtime())
    data_frame.T.to_csv(f"/Users/thanadonxmac/Documents/Python/Project/data_check/{name_file}.csv")

while (True):
    check = input()
    check_user(check)
